{
        "job_position": "Business Analyst",
        "job_location": "Las Vegas, NV",
        "company_name": "SearchPros",
        "company_linkedin_id": "https://www.linkedin.com/company/searchpros?trk=public_jobs_topcard-org-name",
        "job_posting_time": "1 week ago",
        "job_description": "Job Description:  Hybrid Role Oversee, develop, coordinate and administer internal training programs for Vacation Ownership Services division employees.Translate business requirements into system definitions and solutions.Resolve system problems to ensure customer processes run smoothly.Document business processes, training procedures, standard operation procedures and project status, among others.Identify training needs, standardize training initiatives, and track and report on training success.Sets a positive example to others relative to professionalism and the respect of others in order to contribute to a positive tone in the workplace. Gathers information and data on business process and procedures. Receives/identifies problem or process issues and inefficiencies, researches alternatives, contributes to presentations, tests to confirm, and participates in implementing solutions for defined business processes. Works with business partners to create documentation of business processes, training procedures, and standard operating procedures. Generates/monitors standard reports.Reviews and audits information. Assists in coordinating, conducting or facilitating general and specific training programs for organization employees. Assists in preparing training plans relevant to the material. Keeps records and gathers information from course evaluations. May suggest improvements. Delivers established training courses. Provides orientation and onboarding training to new division employees. May travel to other locations to assess needs, deliver trainings and/or perform other business needs. Performs after-hours/weekend testing of system enhancements and fixes. This could be within the division or in conjunction with other First American groups (both onshore and offshore). Monitors the shared email inbox to assist system users with inquiries, requests and/or issues. Gathers information on business objectives from management, determines training needs, and recommends solutions. Actively participates in the design of training/instructional materials including web publications, policy and procedure manuals and client-specific guidelines.Preferred Skills/Qualities Ability to interview, formulate questions Data management skills Has basic knowledge of general business environment/operation and has general cost benefit awareness. Good written and verbal communication skills in order to define parameters to meet business requirements. Standard MS skill set. 1-3 years of directly related experience.Education Must have high school diploma or equivalent Bachelor's degree is highly desirableAbility to pass Background and Drug Screen if Required by Client",
        "Seniority_level": "Entry level",
        "Employment_type": "Contract",
        "Job_function": "Research, Analyst, and Information Technology",
        "Industries": "Staffing and Recruiting",
        "job_apply_link": "https://www.linkedin.com/jobs/view/externalApply/3736845912?url=https%3A%2F%2Fwww2%2Ejobdiva%2Ecom%2Fcandidates%2Fmyjobs%2Fopenjob_outside%2Ejsp%3Fa%3D04jdnwosaaffea78rl6drxhhqb3k080140drna677bz98tp2yi32t4r6x5eeggv3%26SearchString%3D%26StatesString%3D%26source%3Dlinkedin%2Ecom%26id%3D20663268%26compid%3D-1&urlHash=u4lS&trk=public_jobs_apply-link-offsite_sign-up-modal-sign-up-later",
        "recruiter_details": [
            {
                "recruiter_name": "",
                "recruiter_title": ""
            }
            ]
}